app/controllers/cats_controller.rb

SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
      @cat = Cat.find(params[:id])

INSERT INTO "cats" ("name", "age", "hobby", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Four"], ["age", 4], ["hobby", "Likes to eat four catnips at a time."], ["created_at", "2020-03-27 20:14:45.315089"], ["updated_at", "2020-03-27 20:14:45.315089"]]
---
    def create
        # Create a new cat
        @cat = Cat.create(cat_params)

SELECT "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def update
      @cat = Cat.find(params[:id])